def factorial(n): # створення функції
    if n < 0: # якщо n менше 0
        return "Факторіал від'ємного числа не існує" # повертаємо наступний текст користувачу
    elif n == 0: # якщо n дорівнює 0
        return 1  # Факторіал 0 дорівнює 1 за визначенням
    result = 1 # значення змінної
    for i in range(1, n + 1): # створюємо цикл
        result *= i # обчислюємо факторіал
    return result # повертаємо результат


user_input = input('Введіть бажане ціле число для обчислення факторіалу: ') # Запит вводу від юзера

if user_input.isdigit() or (user_input.startswith('-') and user_input[1:].isdigit()): # створюємо конструкцію if else
    number = int(user_input) # конвертуємо введене значення в ціле число
    result = factorial(number) # виводимо результат факторіалу
    print(f"Факторіал числа {number} дорівнює {result}") # прінт результату
else: # інакше
    print("Введено некоректне значення. Будь ласка, введіть ціле число.") # Якщо введене значення не є цілим числом, виведе помилку
# код готовий та працює :D!